<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/99c1ce8b-febf-4f3e-b969-6628dbe06c25/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/prod_keyserver_cluster/prod_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/prod_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod_keyserver_cluster/prod_keyserver-service"
        name                               = "prod_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:13" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:13" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "prod_keyserver" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.remove_me.aws_docdb_cluster.docdb_primary will be created
  + resource "aws_docdb_cluster" "docdb_primary" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "prod-keyserver-remove-me-keystore-docdb-primary-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"
      + deletion_protection             = true
      + enabled_cloudwatch_logs_exports = [
          + "audit",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "keyserver"
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags_all                        = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.remove_me.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = (known after apply)
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "prod-keyserver-remove-me-keystore-docdb-primary-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r6g.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 0
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

  # module.remove_me.aws_docdb_cluster_instance.docdb_replica_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_replica_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = (known after apply)
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "prod-keyserver-remove-me-keystore-docdb-replica-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r6g.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 1
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

  # module.remove_me.aws_docdb_subnet_group.private_subnets will be created
  + resource "aws_docdb_subnet_group" "private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-01553f6b707909828",
          + "subnet-0b8b6aa2510b76442",
          + "subnet-0bf55ab3d71610ce4",
        ]
      + tags_all    = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.remove_me.aws_kms_key.docdb_encryption will be created
  + resource "aws_kms_key" "docdb_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.remove_me.aws_secretsmanager_secret.master_password will be created
  + resource "aws_secretsmanager_secret" "master_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-keyserver-remove-me-keystore-docdb-master-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.remove_me.aws_secretsmanager_secret_version.master_password will be created
  + resource "aws_secretsmanager_secret_version" "master_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.remove_me.aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "prod-keyserver-remove-me-keystore-docdb-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "prod"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-05b5a769e77dfe4c3"
    }

  # module.remove_me.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 10 to add, 2 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/prod_keyserver_cluster/prod_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/prod_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod_keyserver_cluster/prod_keyserver-service"%0A        name                               = "prod_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:13" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod_keyserver:13" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "prod_keyserver" -> (known after apply)%0A      ~ revision                 = 13 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.remove_me.aws_docdb_cluster.docdb_primary will be created%0A  + resource "aws_docdb_cluster" "docdb_primary" {%0A      + apply_immediately               = (known after apply)%0A      + arn                             = (known after apply)%0A      + availability_zones              = (known after apply)%0A      + backup_retention_period         = 1%0A      + cluster_identifier              = "prod-keyserver-remove-me-keystore-docdb-primary-cluster"%0A      + cluster_identifier_prefix       = (known after apply)%0A      + cluster_members                 = (known after apply)%0A      + cluster_resource_id             = (known after apply)%0A      + db_cluster_parameter_group_name = (known after apply)%0A      + db_subnet_group_name            = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"%0A      + deletion_protection             = true%0A      + enabled_cloudwatch_logs_exports = [%0A          + "audit",%0A        ]%0A      + endpoint                        = (known after apply)%0A      + engine                          = "docdb"%0A      + engine_version                  = (known after apply)%0A      + hosted_zone_id                  = (known after apply)%0A      + id                              = (known after apply)%0A      + kms_key_id                      = (known after apply)%0A      + master_password                 = (sensitive value)%0A      + master_username                 = "keyserver"%0A      + port                            = 27017%0A      + preferred_backup_window         = (known after apply)%0A      + preferred_maintenance_window    = (known after apply)%0A      + reader_endpoint                 = (known after apply)%0A      + skip_final_snapshot             = true%0A      + storage_encrypted               = true%0A      + tags_all                        = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + vpc_security_group_ids          = (known after apply)%0A    }%0A%0A  # module.remove_me.aws_docdb_cluster_instance.docdb_instances[0] will be created%0A  + resource "aws_docdb_cluster_instance" "docdb_instances" {%0A      + apply_immediately            = (known after apply)%0A      + arn                          = (known after apply)%0A      + auto_minor_version_upgrade   = true%0A      + availability_zone            = (known after apply)%0A      + ca_cert_identifier           = (known after apply)%0A      + cluster_identifier           = (known after apply)%0A      + db_subnet_group_name         = (known after apply)%0A      + dbi_resource_id              = (known after apply)%0A      + endpoint                     = (known after apply)%0A      + engine                       = "docdb"%0A      + engine_version               = (known after apply)%0A      + id                           = (known after apply)%0A      + identifier                   = "prod-keyserver-remove-me-keystore-docdb-primary-instance-0"%0A      + identifier_prefix            = (known after apply)%0A      + instance_class               = "db.r6g.large"%0A      + kms_key_id                   = (known after apply)%0A      + port                         = (known after apply)%0A      + preferred_backup_window      = (known after apply)%0A      + preferred_maintenance_window = (known after apply)%0A      + promotion_tier               = 0%0A      + publicly_accessible          = (known after apply)%0A      + storage_encrypted            = (known after apply)%0A      + tags_all                     = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + writer                       = (known after apply)%0A    }%0A%0A  # module.remove_me.aws_docdb_cluster_instance.docdb_replica_instances[0] will be created%0A  + resource "aws_docdb_cluster_instance" "docdb_replica_instances" {%0A      + apply_immediately            = (known after apply)%0A      + arn                          = (known after apply)%0A      + auto_minor_version_upgrade   = true%0A      + availability_zone            = (known after apply)%0A      + ca_cert_identifier           = (known after apply)%0A      + cluster_identifier           = (known after apply)%0A      + db_subnet_group_name         = (known after apply)%0A      + dbi_resource_id              = (known after apply)%0A      + endpoint                     = (known after apply)%0A      + engine                       = "docdb"%0A      + engine_version               = (known after apply)%0A      + id                           = (known after apply)%0A      + identifier                   = "prod-keyserver-remove-me-keystore-docdb-replica-instance-0"%0A      + identifier_prefix            = (known after apply)%0A      + instance_class               = "db.r6g.large"%0A      + kms_key_id                   = (known after apply)%0A      + port                         = (known after apply)%0A      + preferred_backup_window      = (known after apply)%0A      + preferred_maintenance_window = (known after apply)%0A      + promotion_tier               = 1%0A      + publicly_accessible          = (known after apply)%0A      + storage_encrypted            = (known after apply)%0A      + tags_all                     = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + writer                       = (known after apply)%0A    }%0A%0A  # module.remove_me.aws_docdb_subnet_group.private_subnets will be created%0A  + resource "aws_docdb_subnet_group" "private_subnets" {%0A      + arn         = (known after apply)%0A      + description = "Managed by Terraform"%0A      + id          = (known after apply)%0A      + name        = "prod-keyserver-remove-me-keystore-docdb-private-subnet-group"%0A      + name_prefix = (known after apply)%0A      + subnet_ids  = [%0A          + "subnet-01553f6b707909828",%0A          + "subnet-0b8b6aa2510b76442",%0A          + "subnet-0bf55ab3d71610ce4",%0A        ]%0A      + tags_all    = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A    }%0A%0A  # module.remove_me.aws_kms_key.docdb_encryption will be created%0A  + resource "aws_kms_key" "docdb_encryption" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = (known after apply)%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = (known after apply)%0A      + tags_all                           = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A    }%0A%0A  # module.remove_me.aws_secretsmanager_secret.master_password will be created%0A  + resource "aws_secretsmanager_secret" "master_password" {%0A      + arn                            = (known after apply)%0A      + force_overwrite_replica_secret = false%0A      + id                             = (known after apply)%0A      + name                           = "prod-keyserver-remove-me-keystore-docdb-master-password"%0A      + name_prefix                    = (known after apply)%0A      + policy                         = (known after apply)%0A      + recovery_window_in_days        = 30%0A      + rotation_enabled               = (known after apply)%0A      + rotation_lambda_arn            = (known after apply)%0A      + tags_all                       = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A    }%0A%0A  # module.remove_me.aws_secretsmanager_secret_version.master_password will be created%0A  + resource "aws_secretsmanager_secret_version" "master_password" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + secret_id      = (known after apply)%0A      + secret_string  = (sensitive value)%0A      + version_id     = (known after apply)%0A      + version_stages = (known after apply)%0A    }%0A%0A  # module.remove_me.aws_security_group.service_security_group will be created%0A  + resource "aws_security_group" "service_security_group" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow ingress from the application"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.0.0.0/16",%0A                ]%0A              + description      = "Allow outbound traffic from the DocDB cluster"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.0.0.0/16",%0A                ]%0A              + description      = "Allow inbound traffic to the DocDB cluster"%0A              + from_port        = 27017%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 27017%0A            },%0A        ]%0A      + name                   = "prod-keyserver-remove-me-keystore-docdb-service"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "prod"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + vpc_id                 = "vpc-05b5a769e77dfe4c3"%0A    }%0A%0A  # module.remove_me.random_password.master_password will be created%0A  + resource "random_password" "master_password" {%0A      + bcrypt_hash = (sensitive value)%0A      + id          = (known after apply)%0A      + length      = 16%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (sensitive value)%0A      + special     = false%0A      + upper       = true%0A    }%0A%0APlan: 10 to add, 2 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*